LTKNgan/LAB1_MCU/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RED_STR_Pin GPIO_PIN_3
#define RED_STR_GPIO_Port GPIOA
#define YELLOW_STR_Pin GPIO_PIN_4
#define YELLOW_STR_GPIO_Port GPIOA
#define GREEN_STR_Pin GPIO_PIN_5
#define GREEN_STR_GPIO_Port GPIOA
#define sm1_a_Pin GPIO_PIN_0
#define sm1_a_GPIO_Port GPIOB
#define sm1_b_Pin GPIO_PIN_1
#define sm1_b_GPIO_Port GPIOB
#define sm1_c_Pin GPIO_PIN_2
#define sm1_c_GPIO_Port GPIOB
#define RED_SIDE_Pin GPIO_PIN_8
#define RED_SIDE_GPIO_Port GPIOA
#define YELLOW_SIDE_Pin GPIO_PIN_9
#define YELLOW_SIDE_GPIO_Port GPIOA
#define GREEN_SIDE_Pin GPIO_PIN_10
#define GREEN_SIDE_GPIO_Port GPIOA
#define sm1_d_Pin GPIO_PIN_3
#define sm1_d_GPIO_Port GPIOB
#define sm1_e_Pin GPIO_PIN_4
#define sm1_e_GPIO_Port GPIOB
#define sm1_f_Pin GPIO_PIN_5
#define sm1_f_GPIO_Port GPIOB
#define sm1_g_Pin GPIO_PIN_6
#define sm1_g_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
